app/controllers/users_controller.rb

  def user_signin
    user = User.where(:email => params[:username]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "neerajjoshi00@gmail.com"]]